IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f2838x_gpio_data_read_regs.xml
<module id="GPIO_DATA_READ_REGS" HW_revision="" description="GPIO DATA READ Registers">
	<register id="GPADAT_R" width="32" page="1" offset="0x0" internal="0" description="GPIO A Data Read Register">
		<bitfield id="DATA" description="GPADAT register value" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="GPBDAT_R" width="32" page="1" offset="0x2" internal="0" description="GPIO B Data Read Register">
		<bitfield id="DATA" description="GPBDAT register value" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="GPCDAT_R" width="32" page="1" offset="0x4" internal="0" description="GPIO C Data Read Register">
		<bitfield id="DATA" description="GPCDAT register value" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="GPDDAT_R" width="32" page="1" offset="0x6" internal="0" description="GPIO D Data Read Register">
		<bitfield id="DATA" description="GPDDAT register value" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="GPEDAT_R" width="32" page="1" offset="0x8" internal="0" description="GPIO E Data Read Register">
		<bitfield id="DATA" description="GPEDAT register value" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="GPFDAT_R" width="32" page="1" offset="0xa" internal="0" description="GPIO F Data Read Register">
		<bitfield id="DATA" description="GPFDAT register value" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
</module>
